<?php
    function get_all_news($id = 0,$collection){
        $news['news'] = [
            [
                'id' => 1,
                'header' => " Марафон «цифровых кафедр»",
                'content' => " 17 апреля в 10:00 на площадке МГПУ выступили команды 12 вузов Центрального федерального округа. Наш ВУЗ не стал исключением. «БелГУ» выступал под 11 номером и занял почётное третье место среди «цифровых кафедр» центрального федерального округа по итогам голосования.<br>
                <center><img src='images/news/17.04.2024_10.jpg' style='width: 70%'> </center><br>Выражаем благодарность всем, кто поддержал «цифровую кафедру» и поздравляем НИУ «БелГУ» с успешным выступлением на марафоне цифровых кафедр 2.0! Посмотреть выступление можно по <a href='https://vk.com/video-223802648_456239058'>ссылке</a>",
                'collection_art' =>
                    [
                        "images/news/17.04.2024_1.jpg",
                        "images/news/17.04.2024_2.jpg",
                        "images/news/17.04.2024_3.jpg",
                        "images/news/17.04.2024_4.jpg",
                        "images/news/17.04.2024_5.jpg",
                        "images/news/17.04.2024_6.jpg",
                        "images/news/17.04.2024_7.jpg",
                        "images/news/17.04.2024_8.jpg",
                        "images/news/17.04.2024_9.jpg",
                        "images/news/17.04.2024_10.jpg"
                    ],

                'img' => "images/news/17.04.2024_1.jpg",
                'date' => "17.04.2024"
            ],
            [
                'id' => 2,
                'header' => "Подведение итогов входного ассессмента.",
                'content' => "Подводя результаты входного ассессмента можно сказать, что его прошли 1933 студента цифровой кафедры. Поздравляем и желаем дальнейших успехов в освоении выбранных программ обучения.<br><br>",
                'collection_art' => "none",
                'img' => "images/news/assesment.jpg",
                'date' => "19.11.2023"
            ],
            [
                'id' => 3,
                'header' => "Тренды цифровой независимости в бизнесе и образовании обсуждают на площадках Иннополиса.",
                'content' => "Представители Белгородского госуниверситета принимают участие в форуме Digital Innopolis Days. На нём собрались руководители цифровых кафедр, чтобы поделиться своим опытом и достижениями.<br><br>
                Белгородский госуниверситет на форуме представляют администратор цифровой кафедры НИУ «БелГУ», доцент кафедры прикладной информатики и информационных технологий Татьяна Зайцева, делопроизводитель цифровой 
                кафедры Анастасия Кротова, студенты из стран БРИКС Цзи Диньи и Се Игэ (Китайская народная республика), Парасураман Гокулакканнан (Индия), а также обучающаяся педагогического института Татьяна Калашник,
                проходившая обучение на цифровой кафедре НИУ «БелГУ» в прошлом году и успешно защитившая свой проект.<br><br> В первый день в ходе пленарной сессии участники форума обсудили вопросы цифровой
                трансформации на пространстве БРИКС, цифровой независимости в бизнесе, образовании и госуправлении. Студенты стали участниками школы кибербезопасности, дискуссии по вопросам освещения «цифровых 
                кафедр».<br><br> - На форуме представилась возможность поделиться мнением об эффективных методах обучения, высказать свою точку зрения на многие образовательные проблемы. Многие идеи, услышанные здесь, 
                обязательно донесём до университетской аудитории, например, использование стартапа, подобного kazan expressдо, - рассказали студенты.<br><br> Татьяна Зайцева отметила, что программа форума насыщена:
                 пленарные сессии, открытые диалоги, а также круглый стол на тему информационной безопасности, ресурсов цифровых кафедр и современных вызовах помогли обменяться опытом с коллегами из других регионов.<br><br>
                В ходе форума будут обсуждаться вопросы цифровой трансформации на пространстве БРИКС, цифровой независимости в бизнесе, образовании и госуправлении.<br><br>",
                'collection_art' =>
                    [
                    "images/news/20.10.2023_1.jpg",
                    "images/news/20.10.2023_2.jpg",
                    "images/news/20.10.2023_3.jpg",
                    "images/news/20.10.2023_4.jpg",
                    "images/news/20.10.2023_5.jpg",
                    "images/news/20.10.2023_6.jpg",
                    "images/news/20.10.2023_7.jpg"
                    ],
                'img' => "images/news/20.10.2023_1.jpg",
                'date' => "20.10.2023"
            ],
            [
                'id' => 4,
                'header' => "Представители НИУ «БелГУ» стали участниками конференции «Цифра для гуманитариев».",
                'content' => "Организаторами масштабной конференции «Цифра для гуманитариев» совместно с Московским государственным институтом международных отношений выступили университет «Иннополис», «Школа 21»
                и «Социоцентр». Белгородский госуниверситет на форуме представили доцент кафедры прикладной информатики и информационных технологий, администратор проекта «Цифровая кафедра» Татьяна Зайцева и 
                руководитель одной из дополнительных профессиональных программ профессиональной переподготовки (ДПП ПП) Ольга Пусная.<br><br>Как отметили организаторы, конференция проводилась с целью помочь
                руководителям цифровых кафедр и представителям индустрии образования, ИТ и edtech обменяться опытом, выявить и масштабировать лучшие практики реализации программ цифровых кафедр, познакомиться с
                методологиями развития «софтовых» навыков и адаптировать преподавание ИТ-компетенций для «нетехнарей», а также найти возможности для сотрудничества с индустриальными и образовательными партнёрами.<br><br>
                Первый день конференции проходил в технопарке высоких технологий «ИТ-парк». С докладами, всесторонне рассматривающими цифровые кафедры, выступили декан факультета финансовой экономики МГИМО, 
                руководитель цифровой кафедры Евгений Погребняк, начальник центра дополнительного образования Московского политехнического университета Денис Воронин, руководитель финтех-хаба Банка России Григорий
                Гашников, проректор – начальник управления академической политики и организации образовательной деятельности университета «Иннополис» Евгений Бобров и другие.<br><br>Участники узнали, как выстроить
                взаимоотношения с партнёрами, как проводить анализ заинтересованных в обучении, построить матрицу компетенций, на каких условиях заключать соглашения и договоры о сотрудничестве и прочее. Поднимались
                вопросы проведения занятий на цифровых кафедрах. Особое внимание уделили отбору студентов на реализуемые цифровыми кафедрами программы подготовки, практико-ориентированному обучению, наличию тьюторов
                или команды сопровождения при обучении, геймификации и прочим немаловажным вопросам.<br><br>– Для меня важным открытием стало то, что в подавляющем большинстве вузов, которые участвуют в проекте
                «Цифровая кафедра», в обязательном порядке читается учебный курс «Программирование», а для студентов не ИТ-специальностей в рамках данной дисциплины преподаются основы языка программирования Pyton.
                Также для всех обязательна математика и учебный курс, который, так или иначе связан с искусственным интеллектом. Мы считаем, что сможем почерпнуть из этого что-то для нашей кафедры, – поделилась
                Татьяна Зайцева.<br><br>После сессии организаторы провели экскурсию в ИТ-парк Казани, который, по словам участников конференции, поразил обилием оборудования для кибер-спорта, программирования,
                3D-моделирования, цифровой анимации, а также цифровой библиотекой, всевозможными симуляторами и многим другим.<br><br>Во второй день конференции «Цифра для гуманитариев», который прошёл на базе
                образовательной платформы «Школа 21», участники попробовали себя в роли программистов и в малых группах обсудили вопросы цифровой кафедры и обменялись опытом: что достигнуто за год, какие усилия
                пришлось приложить, что было трудным, что не получилось.<br><br>– У нашего университета, конечно, есть и свои успехи, которыми мы можем делиться, и свои недочёты, – например, проблемы с привлечением и
                удерживанием студентов на цифровой кафедре, с поиском преподавателей-практиков, нормативной документацией. В «Школе 21» нам удалось выработать предложения для улучшения работы на цифровых кафедрах в
                следующем учебном году, – рассказала Татьяна Валентиновна, – Мы планируем разрабатывать уникальные программы под каждое предприятие, проводить тематические ИТ-дни в университете, поощрять успевающих
                студентов и создать банк заданий и решений.<br><br>В третий день конференции в университете «Иннополис» участники обсудили особенности реализации проекта «Цифровая кафедра» в 2023-24 учебном году,
                рассмотрели перспективы и преимущества сотрудничества учебных заведений с инновационными образовательными стартапами и поделились опытом разработки и реализации программ ДПО с учётом отраслевой
                специфики гуманитариев.<br><br>На заседании круглого стола «Прикладной анализ данных в отраслях специализации» спикеры на самых разных примерах показали, что анализ данных необходим специалистам любого
                 направления подготовки. Закончился форум интерактивной сессией, на которой представители учебных заведений, внедривших проект «Цифровая кафедра», обменялись опытом, передовыми практиками и идеями.<br><br>",
                'collection_art' => "none",
                'img' => "images/news/28.07.2023_header.jpg",
                'date' => "28.07.2023"
            ],
            [
                'id' => 5,
                'header' => "Подведение итогов ассессмента",
                'content' => "Подводя результаты итогового ассессмента можно сказать, что его прошли 99.11% студентов цифровой кафедры.<br><br>
                По программе \"Web-программирование в профессиональной деятельности\" успешно прошли 1273 из 1281 студентов.<br><br>
                По программе \"Программно-информационные средства реализации прикладных задач\" итоговое тестирование прошли 175 из 178 соответственно.<br><br>
                Поздравляем всех студентов с прохождением итогового ассессмента и желаем удачи на защите проектов!!!<br><br>",
                'collection_art' => "none",
                'img' => "images/news/assesment.jpg",
                'date' => "02.06.2023"
            ],
            [
                'id' => 6,
                'header' => "Сроки прохождения итогового ассессмента продлены до 31 мая.",
                'content' => "Сроки прохождения итогового ассессмента продлены до 31 мая.",
                'collection_art' => "none",
                'img' => "images/news/assesment.jpg",
                'date' => "29.05.2023"
            ],
            [
                'id' => 7,
                'header' => "Ассессмент.",
                'content' => "Ассессмент — это набор заданий, ролевых и деловых игр, интервью и других методов оценки, которые позволяют структурированно, комплексно и объективно оценить испытуемого. Говоря простым
                языком - это тестирование, которое помимо факта прохождения тестирования так же показывает уровень компетенций по каждой отдельно взятой дисциплине, что позволяет максималльно точно оценить
                свои знания в конкретной сфере.<br><br>На данный момент ассессмент по программе \"Web-программирование в профессиональной деятельности\" успешно прошли 1021 из 1281 студентов.<br><br>По программе 
                \"Программно-информационные средства реализации прикладных задач\" итоговое тестирование прошли 144 из 181 соответственно.<br><br>Сроки проведения ассессмента: 15.05.2023 - 26.05.2023.",
                'collection_art' => "none",
                'img' => "images/news/assesment.jpg",
                'date' => "25.05.2023"
            ],
            [
                'id' => 8,
                'header' => "НИУ «БелГУ» поделился опытом создания цифровой кафедры на марафоне в Москве.",
                'content' => "Марафон, который проходил на нескольких площадках, объединил более 100 вузов России. Всего в рамках мероприятия выступили 340 спикеров, которые поделились опытом создания и 
                функционирования цифровых кафедр. С приветственным словом к присутствующим обратились заместитель министра энергетики РФЭдуард Шереметцев заместитель директора института дополнительного образования
                университета Иннополис Екатерина Галиханова проректор Российского экономического университета имени Г.В. Плеханова Дмитрий Штыхно и директор департамента развития цифровых компетенций и образования
                Минцифры РФ Татьяна Трудникова.<br><br>Белгородский госуниверситет на марафоне представили студентка 4 курса педагогического института Татьяна Калашник, администратор проекта цифровой кафедры
                Татьяна Зайцева и заведующая кафедрой информатики, естественнонаучных дисциплин и методик преподавания Ольга Сатлер , которая преподаёт на цифровой кафедре и является руководителем проекта.<br><br>
                Ольга Николаевна продемонстрировала презентацию о программе цифровой кафедры. Она отметила, что в современном мире навыки программирования актуальны практически для любой специальности и значительно
                повышают уровень востребованности специалистов на рынке труда после выпуска.<br><br>– При разработке программы цифровой кафедры мы учитывали не только востребованность компетенций, но и то, какие
                направления были бы интересны самим студентам. В первую очередь стоит понимать, что по этой программе будут обучаться не только студенты технических направлений, но и гуманитарии. Мы достигли цели 
                – интерес обучающихся оказался очень высоким, – подчеркнула Ольга Николаевна.<br><br>Спикер добавила, что к проекту присоединились преподаватели разных кафедр, это помогло сделать программу максимально
                насыщенной и разносторонней. В учебном процессе задействованы 59 преподавателей. Также своим опытом со студентами делятся представители крупных IT-компаний региона и страны. – Этот момент важен,
                поскольку слушатели курса могут вживую познакомиться и пообщаться с потенциальными работодателями, продемонстрировать свои навыки. После выпуска специалисты получают два диплома и возможность
                трудоустройства в компанию, связанную с IT-сферой , – резюмировала выступление Ольга Сатлер.<br><br>О мотивации обучаться на цифровой кафедре рассказала студентка Татьяна Калашник, отметив, что
                уже понимает, как сможет применить полученные знания, работая преподавателем в школе.<br><br>В ходе марафона зрителей просили оценить уровень искренности спикеров, чтобы понять, привлекателен ли
                доклад для слушателей. НИУ «БелГУ» получил достаточно высокие оценки от жюри и зрителей. Это свидетельствует о том, что программа кафедры интересна, а информация подаётся в простой и доступной форме.<br><br>
                На мероприятии обсудили не только положительные, но проблемные стороны получения цифрового образования. Так, часть студентов из разных вузов отметила сложность совмещения обучения с основными парами
                 и невозможность задать вопрос преподавателю непосредственно во время лекции, если они проходят не в дистанционном формате, а предоставляются в записи. Для справки: «Цифровые кафедры» открыты в
                  114 вузах в 50 регионах страны. В общей сложности разработано более 500 образовательных программ переподготовки по ИТ-направлениям. На цифровой кафедре НИУ «БелГУ» в данный момент обучается порядка
                   1500 студентов. Подготовка осуществляется по двум программам: «Web-программирование в профессиональной деятельности» и «Программно-информационные средства реализации прикладных задач». Занятия
                    проходят в дистанционном формате с учётом занятости студентов на основном направлении подготовки.<br><br>",
                'collection_art' =>
                    [
                       "images/news/31.03.2023_1.jpg",
                       "images/news/31.03.2023_2.jpg",
                       "images/news/31.03.2023_3.jpg",
                       "images/news/31.03.2023_4.jpg",
                    ],
                'img' => "images/news/31.03.2023_header.jpg",
                'date' => "31.03.2023"
            ],
            [
                'id' => 9,
                'header' => "Марафон цифровых кафедр.",
                'content' => "Не пропустите выступление вашего ВУЗа 30 марта. <a href='https://events.innopolis.university/marathon_dd'>Ссылка</a>",
                'collection_art' => "none",
                'img' => "images/news/18.03.2023_header.jpg",
                'date' => "18.03.2023"
            ],
            [
                'id' => 10,
                'header' => "111 российских вузов расскажут о работе своих «цифровых кафедр».",
                'content' => "Встречи для студентов, сотрудников университетов, индустриальных и ИТ-компаний пройдут 13—31 марта на площадках в Москве, Санкт-Петербурге, Томске, 
                Екатеринбурге, Ростове-на-Дону, Нижнем Новгороде и Иннополисе. Подключиться к онлайн-трансляции «Марафона цифровых кафедр» может любой желающий. Организатор — Университет
                 Иннополис при поддержке Минцифры РФ, Министерства науки и высшего образования РФ, национального проекта «Цифровая экономика» и «Социоцентра».<br><br>«Марафон цифровых 
                 кафедр» — это мероприятия для участников национального проекта «Цифровые кафедры». Руководители, преподаватели и студенты расскажут, как устроены «цифровые кафедры» в их 
                 вузах, в каких целях созданы, чему на них обучают, как разрабатывались образовательные программы и проходила рекламная кампания для абитуриентов.<br><br>Мария Образцова, 
                 директор Института дополнительного образования Университета Иннополис: «Марафон “цифровых кафедр” организован не только для обмена опытом между действующими членами проекта. 
                 Участие как в офлайн-мероприятиях, так и в онлайн-встречах будет полезно представителям вузов, только планирующим открыть “цифровую кафедру” в своем учебном заведении, а 
                 также студентам, желающим получить дополнительную ИТ-профессию, и компаниям с потребностью в квалифицированных ИТ-специалистах». Программа марафона и регистрация для 
                 онлайн-участников: <a href='https://events.innopolis.university/marathon_dd'>Ссылка</a><br><br>Проект «Цифровые кафедры» стартовал в апреле 2022 года и реализуется в рамках федерального проекта «Развитие кадрового потенциала 
                 ИТ-отрасли» национального проекта «Цифровая экономика». В сентябре «Цифровые кафедры» открыли в более чем 50 регионах страны: в 100 вузах-участниках программы 
                 «Приоритет-2030» и 14 вузах-кандидатах на участие в этой программе, на них зачислено свыше 110 тысяч студентов.<br><br>Так же студентка цифровой кафедры Чистюхина Э.И. 
                 была награждена сертификатом за участие в тренинге по искусству представления сложной научной информации \"Школа научного доклада\" в онлайн формате<br><br>
                Обратите внимание, что самые свежие новости о «Марафоне цифровых кафедр» будут размещены в канале <a href='https://t.me/moyacifrovaya'>«Моя цифровая кафедра»</a>",
                'collection_art' =>
                    [
                        "images/news/01.03.2023_1.jpg"
                    ],
                'img' => "images/news/01.03.2023_header.jpg",
                'date' => "01.03.2023"
            ],
            [
                'id' => 11,
                'header' => "Студенты НИУ «БелГУ» смогут получить дополнительную квалификацию в ИТ-сфере !!!",
                'content' => "До 2030 года на «цифровой кафедре» вуза по программе «Приоритет-2030» более 5000 студентов получат к основной квалификации дополнительную в сфере информационных
                 технологий. Перспективы реализации проекта «Получение студентами дополнительной квалификации по ИТ-профилю на базе «Цифровой кафедры» программы «Приоритет-2030» обсудили
                на заседании совета по стратегическому развитию НИУ «БелГУ» под руководством ректора, профессора Олега Полухина.<br><br> Как рассказал директор департамента образовательной
                 политики НИУ «БелГУ» Александр Немцев, сегодня в вузе по двум дополнительным программам профессиональной переподготовки «Программно- информационные средства реализации
                прикладных задач» и «Web- программирование в профессиональной деятельности» обучаются 1555 слушателей, а к 2024 году освоить современные цифровые технологии по программам
                допобразования должны более 5000 студентов. При этом, как отметил Александр Николаевич, возможность получить дополнительную ИТ- квалификацию при желании будут иметь
                абсолютно все обучающиеся.<br><br> Чтобы образование было качественным, трёхуровневую федеральную оценку прошли не только сами образовательные программы, высокие требования
                 предъявляются и к преподавателям, которые преимущественно должны быть практикующими специалистами.<br><br> Директор департамента обратил внимание и на образовательный процесс,
                который начинается с входного тестирования студентов и распределения их по группам, исходя из уровня имеющихся знаний. Особое внимание на курсе уделяется организации 
                производственной практики, которая должна проходить на предприятиях ИТ-сферы, а на выходе каждому из обучающихся предстоит защитить реальный проект.<br><br>Озвучил Александр
                 Николаевич и риски. В их числе отсутствие достаточного количества профильных организаций для формирования баз практик, сильная занятость студентов в рамках основной образовательной
                программы и низкая мотивация к освоению ИТ-компетенций, особенно в области программирования (что является одним из основных требований Минцифры).– Чтобы студентам было
                понятно, чем им могут быть полезны в дальнейшем новые знания, необходимо проводить для них предварительныеобзорные лекции и консультации по вопросам обучения по 
                программам переподготовки. Также предстоит серьёзная работа с партнёрами НИУ «БелГУ» – ИТ-фирмами по организации мест практик и постановке практических задач для 
                выполнения итоговых проектов, – прокомментировал Александр Немцев.<br><br>Говоря о планах на 2023 год, спикер отметил, что для обучения на «цифровую кафедру» планируют
                 принять не менее 1700 обучающихся. Также предстоит разработка и федеральная экспертиза новых программ ДПП «Создание и сопровождение информационных систем в экономике 
                 средствами платформы 1С:Предприятие» и «Программирование и конфигурирование платформы 1С:Предприятие».<br><br>",
                'collection_art' => "none",
                'img' => "images/news/16.02.2023_header.jpg",
                'date' => "16.02.2023"
            ],
            [
                'id' => 12,
                'header' => "Завершено прохождение промежуточного ассессмента.",
                'content' => "Студенты, обучающиеся на цифровой кафедре, на данный момент изучили принципы и основы алгоритмизации, прикладного программирования и разработки прикладных
                 программ. По мнению обучающихся, занятия на цифровой кафедре очень полезны. Так, студентка направления подготовки «Инфокоммуникационные технологии и системы связи» Ирина
                  Политова проходит обучение на цифровой кафедре по дополнительной профессиональной программе профессиональной переподготовки «Программно-информационные средства реализации
                   прикладных задач».<br><br>
                – Убеждена, что цифровые компетенции необходимы не только выпускникам профильных IT-направлений. Цифровая кафедра дает уникальную возможность полнее реализовать себя в 
                будущей профессии, – поделилась своими впечатлениями студентка.<br><br>Преимущества занятий на цифровой кафедре выделил студент направления «Инфокоммуникационные технологии
                 и системы связи» Евгений Неймышев.<br><br>– Цифровая кафедра широко сотрудничает с IT-компаниями, предоставляющими возможность для прохождения практики и стажировок. Хочется
                  поучаствовать в разработке проекта, который будет полезен людям с ограниченными возможностями здоровья. С этой целью можно разрабатывать специализированные мобильные 
                  приложения, в развитии этого направления видится большой потенциал, – отметил Евгений.<br><br>В рамках прохождения практики обучающиеся на цифровой кафедре будут
                   получать прикладные задания в рамках реализации реальных проектов.",
                'collection_art' => "none",
                'img' => "images/news/assesment.jpg",
                'date' => "14.02.2023"
            ],
            [
                'id' => 13,
                'header' => "Форум о цифровой трансформации в образовании, бизнесе и госуправлении.",
                'content' => "В период с 24 по 26 ноября 2022 года в г. Иннополис (республика Татарстан) проходил Форум о цифровой трансформации в образовании, бизнесе и госуправлении. 
                Представители цифровой кафедры НИУ \"БелГУ\" заведующий кафедрой информатики, естественнонаучных дисциплин и методик преподавания, к.т.н., доцент Сатлер Ольга Николаевна и
                 доцент кафедры прикладной информатики и информационных технологий, к.т.н., доцент Зайцева Татьяна Валентиновна 24 ноября 2022 года приняли участие в работе Заседания
                  отраслевой рабочей группы «Информационно-коммуникационные технологии», на котором были рассмотрены следующие вопросы:<br><br>
                1. Об итогах деятельности отраслевой рабочей группы «Информационно-коммуникационные технологии» в 2022 году;<br>
                2. О результатах внедрения сквозных цифровых технологий в основных профессиональных образовательных программах:<br>
                 ★ 09.03.01 Информатика и вычислительная техника, 09.04.01 Информатика и вычислительная техника, • 09.03.03 Прикладная информатика, 09.04.03 Прикладная информатика (ФГАОУ ВО
                  «Московский физико-технический институт» (Национальный исследовательский университет);<br>
                 ★ 09.03.02 Информационные системы и технологии, 09.04.02 Информационные системы и технологии, 09.03.04 Программная инженерия, 09.04.04 Программная инженерия (ФГАОУ ВО
                  «Уральский федеральный университет имени первого Президента России Б.Н. Ельцина»);<br>★ 45.03.01 Филология, 45.04.01 Филология (по направленности (профилю) в сфере 
                  компьютерной лингвистики) (ФГБОУ ВО «Государственный институт русского языка им. А.С. Пушкина»);<br>3. О результатах обучения по программе повышения 
                  квалификациипрофессорско-преподавательского состава в рамках проекта «Опорный образовательный и Единый учебно-методологический центры»;<br>
                4. Участие экспертов рабочей группы «Информационно-коммуникационные технологии» в проекте «Цифровые кафедры»;<br>
                5. Проект «Новое индустриальное ПО» - возможности для российских разработчиков и системы образования».<br><br>
                25 ноября 2022 года Сатлер О.Н. и Зайцева Т.В. приняли участие в работе конференции Цифровая трансформация, панельная дискуссия \"Результаты ассессмента студентов в рамках
                 федерального проекта «Цифровые кафедры»\". В секции \"Дополнительные профессиональные программы профессиональной переподготовки: разработка, трудности и их преодоление\" 
                 Зайцева Т.В. выступила в роли спикера с докладом \"Проблемы разработки программ переподготовки в сфере информатики для студентов не ИТ-специальностей\" (авторы Ломакин В.В.,
                  Зайцева Т.В., Сатлер О.Н.).<br><br>",
                'collection_art' => "none",
                'img' => "images/news/assesment.jpg",
                'date' => "30.12.2022"
            ],
            [
                'id' => 14,
                'header' => "Завершено прохождение промежуточного ассессмента студентами НИУ «БелГУ»",
                'content' => "Завершено прохождение промежуточного ассессмента студентами НИУ «БелГУ». На 26 декабря всего 41 обучающийся цифровой кафедры (менее 3% от числа обучающихся по 
                ДПП ПП «Web-программирование в профессиональной деятельности» и ДПП ПП «Программно-информационные средства реализации прикладных задач») не прошли или не успели вовремя
                 завершить промежуточное тестирование.",
                'collection_art' => "none",
                'img' => "images/news/assesment.jpg",
                'date' => "26.12.2022"
            ],
            [
                'id' => 15,
                'header' => "Продлены сроки прохождения промежуточного ассессмента до 25 декабря.",
                'content' => "Продлены сроки прохождения промежуточного ассессмента до 25 декабря.",
                'collection_art' => "none",
                'img' => "images/news/assesment.jpg",
                'date' => "20.12.2022"
            ],
            [
                'id' => 16,
                'header' => "Осталось 2 дня на прохождение промежуточного ассессмента.",
                'content' => "Осталось 2 дня на прохождение промежуточного ассессмента. На данный момент промежуточное тестирование прошло более 80% обучающихся.",
                'collection_art' => "none",
                'img' => "images/news/assesment.jpg",
                'date' => "19.12.2022"
            ],
            [
                'id' => 17,
                'header' => "15 декабря в период 00:00 до 1:00 по московскому времени платформа Университета Иннополис будет недоступна.",
                'content' => "15 декабря в период 00:00 до 1:00 по московскому времени платформа Университета Иннополис может быть временно недоступна. Тестирование студентов в рамках 
                обучения на Цифровой кафедре не будет производиться..",
                'collection_art' => "none",
                'img' => "images/news/assesment.jpg",
                'date' => "14.12.2022"
            ],
            [
                'id' => 18,
                'header' => "С 1 декабря стартует промежуточное тестирование.",
                'content' => "С 1 декабря стартует промежуточное тестирование (ассессмент) студентов, которое является обязательным элементом при обучении на Цифровой кафедре и 
                проводится на платформе Университета Иннополис.",
                'collection_art' => "none",
                'img' => "images/news/assesment.jpg",
                'date' => "04.12.2022"
            ],
            [
                'id' => 19,
                'header' => "С 1 сентября стартует набор студентов, для обучения на цифровой кафедре.",
                'content' => "С 1 сентября стартует набор студентов, для обучения на цифровой кафедре программам \"Программно-информационные средства реализации прикладных задачи\" и \"Web-п
                рограммирование в профессиональной деятельности\".",
                'collection_art' => "none",
                'img' => "images/news/30.09.2022_header.jpg",
                'date' => "30.09.2022"
            ]

        ];
        if($collection == "none")
        {
            if ($id != 0)
                return $news['news'];
            else
                return $news['news'];
        }
        else
        {
            if ($id != 0)
                return $news['news'][$id-1]['collection_art'];
            else
                return $news['news'];
        }

    }
    function get_all_programms($id = 0,$collection){
        $programms['programms'] = [
            [
                'id' => 1,
                'programm_name' => "Программно-информационные средства реализации прикладных задач.",
                'header' => "Руководитель программы - заведующий кафедрой прикладной информатики и информационных технологий, к.т.н., доцент Ломакин Владимир Васильевич Описание программы.",
                'link' => "files/Programms1.pdf",
                'teachers' =>
                    [
                        "Болгова Евгения Витальевна, доцент кафедры прикладной информатики и информационных технологий",
                        "Гахова Нина Николаевна, доцент кафедры прикладной информатики и информационных технологий",
                        "Зайцева Татьяна Валентиновна, доцент кафедры прикладной информатики и информационных технологий",
                        "Мордовская Ольга Сергеевна, доцент кафедры прикладной информатики и информационных технологий",
                        "Муромцев Виктор Владимирович, доцент кафедры математического и программного обеспечения информационных систем",
                        "Пусная Ольга Петровна, старший преподаватель кафедры прикладной информатики и информационных технологий",
                        "Резниченко Олег Сергеевич, старший преподаватель кафедры прикладной информатики и информационных технологий",
                        "Румбешт Вадим Валерьевич, доцент кафедры математического и программного обеспечения информационных систем",
                        "Явурик Ольга Васильевна, доцент кафедры прикладной информатики и информационных технологий"
                    ],
                'lead' => "Ломакин Владимир Васильевич - Заведующий кафедрой прикладной информатики и информационных технологий, кандидат технических наук, доцент.",
                'img' => "images/icons/programm1.png"
            ],
            [
                'id' => 2,
                'programm_name' => "Web-программирование в профессиональной деятельности.",
                'header' => "Руководитель программы - заведующий кафедрой информатики, естественнонаучных дисциплин и методик преподавания, к.т.н., доцент Сатлер Ольга Николаевна.",
                'link' => "files/Programms2.pdf",
                'teachers' =>
                    [
                        "Беляева Ирина Николаевна, доцент кафедры информатики, естественнонаучных дисциплин и методик преподавания",
                        "Величко Максим Андреевич, заведующий кафедрой математики",
                        "Гальцева Оксана Александровна, доцент кафедры информатики, естественнонаучных дисциплин и методик преподавания",
                        "Гладких Юлия Петровна, доцент кафедры информатики, естественнонаучных дисциплин и методик преподавания",
                        "Коренькова Наталья Анатольевна, старший преподаватель кафедры информатики, естественнонаучных дисциплин и методик преподавания",
                        "Костина Ирина Борисовна, доцент кафедры информатики, естественнонаучных дисциплин и методик преподавания",
                        "Макарова Юлия Александровна, старший преподаватель кафедры информатики, естественнонаучных дисциплин и методик преподавания",
                        "Пронина Марина Викторовна, учебный мастер учебно-методического ресурсного центра практико-ориентированного обучения педагогического института",
                        "Сатлер Ольга Николаевна, заведующий кафедрой информатики, естественнонаучных дисциплин и методик преподавания",
                        "Старков Владислав Витальевич, делопроизводитель кафедры прикладной математики и компьютерного моделирования",
                    ],
                'lead' => "Сатлер Ольга Николаевна - заведующий кафедрой информатики, естественнонаучных дисциплин и методик преподавания, кандидат технических наук, доцент.",
                'img' => "images/icons/programm2.png"
            ],
            [
                'id' => 3,
                'programm_name' => "Технологии виртуальной и дополненной реальности в образовании.",
                'header' => "Руководитель программы - заведующий кафедрой информатики, естественнонаучных дисциплин и методик преподавания, к.т.н., доцент Сатлер Ольга Николаевна.",
                'link' => "files/Programms3.pdf",
                'teachers' =>
                    [
                        "Гальцева Ирина Николаевна, старший преподаватель кафедры информатики, естественнонаучных дисциплин и методик преподавания",
                        "Беляева Ирина Николаевна, доцент кафедры информатики, естественнонаучных дисциплин и методик преподавания",
                        "Гальцева Оксана Александровна, доцент кафедры информатики, естественнонаучных дисциплин и методик преподавания",
                        "Гладких Юлия Петровна, доцент кафедры информатики, естественнонаучных дисциплин и методик преподавания",
                        "Коренькова Наталья Анатольевна, старший преподаватель кафедры информатики, естественнонаучных дисциплин и методик преподавания",
                        "Костина Ирина Борисовна, доцент кафедры информатики, естественнонаучных дисциплин и методик преподавания",
                        "Макарова Юлия Александровна, старший преподаватель кафедры информатики, естественнонаучных дисциплин и методик преподавания",
                        "Сатлер Ольга Николаевна, заведующий кафедрой информатики, естественнонаучных дисциплин и методик преподавания"
                    ],
                'lead' => "Сатлер Ольга Николаевна - заведующий кафедрой информатики, естественнонаучных дисциплин и методик преподавания, кандидат технических наук, доцент.",
                'img' => "images/icons/programm3.png"
            ],
            [
                'id' => 4,
                'programm_name' => "Средства интеллектуальной обработки информации в социально-экономической сфере.",
                'header' => "Руководитель программы - кандидат технических наук, доцент кафедрыприкладной информатики и информационных технологий Путивцева Наталья Павловна.",
                'link' => "files/Programms4.pdf",
                'teachers' =>
                    [
                        "Асадуллаев Рустам Геннадьевич, кандидат технических наук, доцент",
                        "Болгова Евгения Виатльевна, кандидат технических наук, доцент",
                        "Бугаева Екатерина Сергеевна, Старший преподаватель",
                        "Зайцева Татьяна Валентиновна, кандидат технических наук, доцент",
                        "Ломакин Владимир Васильевич, Заведующий кафедрой прикладной информатики и информационных технологий, кандидат технических наук, доцент",
                        "Петина Мария Александровна, Кандидат географических наук, доцент",
                        "Путивцева Наталья Павловна, кандидат технических наук, доцент"
                    ],
                'lead' => "Путивцева Наталья Павловна - кандидат технических наук, доцент.",
                'img' => "images/icons/programm4.png"
            ],
            [
                'id' => 5,
                'programm_name' => "Создание и сопровождение информационных систем в экономике средствами платформы 1С: Предприятие.",
                'header' => "Руководитель программы - старший преподаватель Гуль Светлана Владимировна.",
                'link' => "files/Programms5.pdf",
                'teachers' =>
                    [
                        "Гуль Светлана Владимировна, старший преподаватель",
                        "Зайцева Татьяна Валентиновна, кандидат технических наук, доцент кафедры прикладной информатики и информационных технологий",
                        "Ломакин Владимир Васильевич, кандидат технических наук, доцент кафедры прикладной информатики и информационных технологий",
                        "Пусная Ольга Петровна, Старший преподаватель кафедры прикладной информатики и информационных технологий"
                    ],
                'lead' => "Гуль Светлана Владимировна - старший преподаватель.",
                'img' => "images/icons/programm5.png"
            ],
            [
                'id' => 6,
                'programm_name' => "Информационные системы в профессиональной деятельности.",
                'header' => "Руководитель программы - Старший преподаватель Пусная Ольга Петровна.",
                'link' => "files/Programms6.pdf",
                'teachers' =>
                    [
                        "Гуль Светлана Владимировна, старший преподаватель",
                        "Зайцева Татьяна Валентиновна, кандидат технических наук, доцент кафедры прикладной информатики и информационных технологий",
                        "Ломакин Владимир Васильевич, кандидат технических наук, доцент кафедры прикладной информатики и информационных технологий",
                        "Пусная Ольга Петровна, Старший преподаватель кафедры прикладной информатики и информационных технологий",
                        "Резниченко Олег Сергеевич, старший преподаватель кафедры прикладной информатики и информационных технологий",
                    ],
                'lead' => "Пусная Ольга Петровна - старший преподаватель.",
                'img' => "images/icons/programm6.png"
            ],
            [
                'id' => 7,
                'programm_name' => "Программа находится в разработке",
                'header' => "Программа находится в разработке",
                'link' => "",
                'teachers' => "none",
                'lead' => "",
                'img' => "images/icons/futureprogramm.png"
            ],
            [
                'id' => 8,
                'programm_name' => "Программа находится в разработке",
                'header' => "Программа находится в разработке",
                'link' => "",
                'teachers' => "none",
                'lead' => "",
                'img' => "images/icons/futureprogramm.png"
            ],
            [
                'id' => 9,
                'programm_name' => "Программа находится в разработке",
                'header' => "Программа находится в разработке",
                'link' => "",
                'teachers' => "none",
                'lead' => "",
                'img' => "images/icons/futureprogramm.png"
            ],
            [
                'id' => 10,
                'programm_name' => "Программа находится в разработке",
                'header' => "Программа находится в разработке",
                'link' => "",
                'teachers' => "none",
                'lead' => "",
                'img' => "images/icons/futureprogramm.png"
            ],
        ];
        if($collection == "none")
        {
            if ($id != 0)
                return $programms['programms'];
            else
                return $programms['programms'];
        }
        else
        {
            if ($id != 0)
                return $programms['programms'][$id-1]['teachers'];
            else
                return $programms['programms'];
        }
}
